// function goToPage(pageName, buttonId) {
//     // שומר את הכפתור שנלחץ
//     sessionStorage.setItem('lastButton', buttonId);
//     // מעבר לעמוד המבוקש
//     window.location.href = pageName;
// }

// function goBack() {
//     const lastPage = sessionStorage.getItem('lastPage');
//     if (lastPage) {
//         window.location.href = lastPage; // חזרה לעמוד האחרון שנשמר
//     } else {
//         window.history.back(); // fallback אם אין ערך
//     }
// }


// let currentSubject;
// let currentDevice = "phone";

// function goToConfirmBinleumi(subject){

//     sessionStorage.setItem("subjectChosen", subject);
//     window.location.href = "binleumiConfirm.html";

// }

// const subjectsData = {

//     moneyFlowSub: {
//         phone: "נכנסים לאפליקציה\nלוחצים על- תפריט\nלוחצים על- התכתבות על הבנק\nלוחצים על- דוחות,אישורים ודפי חשבון\nלוחצים על- דפי חשבון",
//         computer: "נכנסים לאתר\nלוחצים על- תנועות עו\"ש\nלוחצים על- להפיק דוח\nלוחצים על- להפיק מסמך"
//     },

//     accountSub: {
//         phone: "נכנסים לאפליקציה\nלוחצים על- דוחות ואישורים\nלוחצים על- דוח ניהול חשבון\nמייצאים כקובץ",
//         computer: "נכנסים לאתר\nלוחצים על- דוחות ואישורים\nלוחצים על- דוח ניהול חשבון\nמייצאים כקובץ"
//     },

//     moneyLeftSub: {
//         phone: "נכנסים לאפליקציה\nלוחצים על- תפריט\nלוחצים על- התכתבות עם הבנק\nלוחצים על- דוחות, אישורים ודפי חשבון\nלוחצים על- אישור יתרה",
//         computer: "נכנסים לאתר\nלוחצים על- דוחות ואישורים\nלוחצים על- דוח אישורי יתרה"
//     },

//     creditSub: {
//         phone: "נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- לגרסה במחשב\nלוחצים על- כרטיסי חיובים\nלוחצים על- פירוט חיובים\nמייצאים כקובץ",
//         computer: "נכנסים לאתר\nלוחצים על- כרטיסי חיובים\nלוחצים על- פירוט חיובים\nמייצאים כקובץ"
//     }

// };

// window.addEventListener("pageshow", ()=>{

//     const textBox = document.getElementById("textContent");
//     if(!textBox) return;

//     currentSubject = sessionStorage.getItem("subjectChosen");

//     const title = document.getElementById("titleImg");

//     if(title){
//         title.src = `assets/titles/${currentSubject}.png`;
//     }

//     const phoneButtonB = document.getElementById("phoneBtn");
//     const computerButtonB = document.getElementById("computerBtn");

//     if(phoneButtonB && computerButtonB){

//         phoneButtonB.onclick = ()=>{

//             currentDevice = "phone";

//             phoneButtonB.src = "assets/elements/phoneClicked.png";
//             computerButtonB.src = "assets/elements/computer.png";

//             updateBankText();
//         };

//         computerButtonB.onclick = ()=>{

//             currentDevice = "computer";

//             computerButtonB.src = "assets/elements/computerClicked.png";
//             phoneButtonB.src = "assets/elements/phone.png";

//             updateBankText();
//         };
//     }
// function updateBankText(){

//     const textBox = document.getElementById("textContent");

//     textBox.innerText =
//     subjectsData[currentSubject][currentDevice];

// }
//     updateBankText();

// });

// function updateBankText(){

//     const textBox = document.getElementById("textContent");

//     textBox.innerText =
//     subjectsData[currentSubject][currentDevice];

// }
// בנקים
let activeBank;
let activeSubject;
let activeDevice = "phone";
function chooseBank(bankName){

    sessionStorage.setItem("selectedBank", bankName);

    window.location.href = "menuBank.html";

}
function goToConfirm(subjectName){

    sessionStorage.setItem("selectedSubject", subjectName);

    window.location.href = "confirm.html";

}

const banksData = {
bank2:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n נכנסים לפעולות נפוצות\n לוחצים על- בקשה לקבלת דוח תנועות\n בוחרים בשלושה חודשים אחרונים\nבוחרים את המייל\nלוחצים על- שלח בקשה",
        computer:"נכנסים לאתר\n נכנסים לפעולות נפוצות\n לוחצים על- בקשה לקבלת דוח תנועות\n בוחרים בשלושה חודשים אחרונים\nבוחרים את המייל\nלוחצים על- שלח בקשה"
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\nתחת הגדרת המינוי, לוחצים על- בקשה לקבלת אישור ניהול חשבון\nלוחצים על- דואר אלקטרוני מאובטח\nרושמים את המייל ואת מס' הטלפון\nלוחצים- שלח בקשה\n מזינים את הקוד שהתקבל\nשומרים כקובץ",
        computer:"נכנסים לאתר\nתחת הגדרת המינוי, לוחצים על- בקשה לקבלת אישור ניהול חשבון\nלוחצים על- דואר אלקטרוני מאובטח\nרושמים את המייל ואת מס' הטלפון\nלוחצים- שלח בקשה\n מזינים את הקוד שהתקבל\nשומרים כקובץ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\nנכנסים לפעולות נפוצות \nלוחצים על- ריכוז יתרות\nמצד שמאל למעלה נלחץ על אייקון המדפסת\nלוחצים על- בחר מדפסת\n בוחרים- שמור כ\n PDF",
        computer:" נכנסים לאתר\nנכנסים לפעולות נפוצות\nלוחצים על- ריכוז יתרות\nמצד שמאל למעלה נלחץ על אייקון המדפסת\nלוחצים על- בחר מדפסת\n בוחרים- שמור כ\n PDF"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n בצד ימין לוחצים על- כרטיסי אשראי\n לוחצים על- כרטיסים בחשבון שלי\nלוחצים על הכרטיס הרצוי\nבוחרים בחודש הרצוי\n   בצד שמאל למעלה לוחצים על-  PDF שמור",
        computer:"נכנסים לאתר\n בצד ימין לוחצים על- כרטיסי אשראי\n לוחצים על- כרטיסים בחשבון שלי\nלוחצים על הכרטיס הרצוי\nבוחרים בחודש הרצוי\n   בצד שמאל למעלה לוחצים על-  PDF שמור"
    }
},
bank3:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- עוש\n בוחרים- שלושה חודשים\n מצד שמאל לוחצים על- שמירה והדפסה\n  PDF בוחרים",
        computer:"נכנסים לאתר\n לוחצים על- עוש\n לוחצים על- תנועות אחרונות\n מצד שמאל, לוחצים על- \n שמירה והדפסה\n  PDF מייצאים כקובץ "
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- דוחות\n לוחצים על- אישור ניהול חשבון \nלוחצים על- שמירה והדפסה\n  PDF בוחרים ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- אישור ניהול חשבון\n מצד שמאל לוחצים על- שמירה והדפסה\n PDFמייצאים כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- דוחות\n לוחצים על- ריכוז יתרות ליום קודם\nלוחצים על- שמירה והדפסה\n  PDF בוחרים ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- ריכוז יתרות ליום קודם\n מצד שמאל לוחצים על- שמירה והדפסה\n PDFמייצאים כ"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על- שלושת הנקודות\n לוחצים על- גרסה למחשב\nלוחצים על- דוחות, דוח נתוני אשראי\n בוחרים מס טלפון, הודעה\n לוחצים על- שלח לי קוד ומזינים את הקוד שקיבלנו\n לוחצים על- שמירה והדפסה\n  PDF מייצאים כקובץ ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- דוח נתוני אשראי\nבוחרים מס טלפון,הודעה\nלוחצים על- שלח לי קוד ומזינים את הקוד שקיבלנו\n לוחצים על- שמירה והדפסה\n  PDF מייצאים כקובץ "
    }
},
bank4:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- עובר ושב\n לוחצים על- יתרה ותנועות בחשבון\n לוחצים על- שלושה חודשים אחרונים\n מצד שמאל למעלה לוחצים על- שמירה",
        computer:"נכנסים לאתר\n לוחצים על- עובר ושב\n לוחצים על- יתרה ותנועות בחשבון\n לוחצים על- שלושה חודשים אחרונים\n מצד שמאל למעלה לוחצים על- שמירה"
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- עובר ושב\n לוחצים על- עובר ושב שלי\n לוחצים על- אישורים ומסלולי עמלות\n לוחצים על- ניהול חשבון ורשימת חשבונותיך בבנק\n לוחצים על אייקון המדפסת, על החץ ליד יעד\n PDF בוחרים- שמור כ",
        computer:"נכנסים לאתר\n לוחצים על- עובר ושב\n  לוחצים על- עובר ושב שלי\n לוחצים על- אישורים ומסלולי עמלות\n לוחצים על- ניהול חשבון ורשימת חשבונותיך בבנק\n לוחצים על אייקון המדפסת, על החץ ליד יעד\n PDF בוחרים- שמור כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\ לוחצים על- עובר ושב\n לוחצים על- עובר ושב שלי\n לוחצים על- ריכוז יתרות\n לוחצים על אייקון המדפסת, על החץ ליד יעד\n PDF בוחרים- שמור כ",
        computer: "נכנסים לאתר\n לוחצים על- עובר ושב\n לוחצים על- עובר ושב שלי\n לוחצים על- ריכוז יתרות\n לוחצים על אייקון המדפסת, על החץ ליד יעד\n PDF בוחרים- שמור כ"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשבnלוחצים על- כרטיסי אשראי\nלוחצים על- הכרטיזסים שלי\nבוחרים חודש\nלוחצים על אייקון המדפסת,על החץ ליד יעד\n PDF בוחרים- שמור כ",
        computer:"נכנסים לאתר\nלוחצים על- כרטיסי אשראי\nלוחצים על- הכרטיזסים שלי\nבוחרים חודש\nלוחצים על אייקון המדפסת,על החץ ליד יעד\n PDF בוחרים- שמור כ"
    }
},
bank5:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- עוש\n בוחרים- שלושה חודשים\n מצד שמאל לוחצים על- שמירה והדפסה\n  PDF בוחרים",
        computer:"נכנסים לאתר\n לוחצים על- עוש\n לוחצים על- תנועות אחרונות\n מצד שמאל, לוחצים על- \n שמירה והדפסה\n  PDF מייצאים כקובץ "
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- דוחות\n לוחצים על- אישור ניהול חשבון \nלוחצים על- שמירה והדפסה\n  PDF בוחרים ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- אישור ניהול חשבון\n מצד שמאל לוחצים על- שמירה והדפסה\n PDFמייצאים כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על- שלושת הנקודות\n לוחצים על- לגרסה למחשב\n לוחצים על- דוחות\n לוחצים על- ריכוז יתרות ליום קודם\nלוחצים על- שמירה והדפסה\n  PDF בוחרים ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- ריכוז יתרות ליום קודם\n מצד שמאל לוחצים על- שמירה והדפסה\n PDFמייצאים כ"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על- שלושת הנקודות\n לוחצים על- גרסה למחשב\nלוחצים על- דוחות, דוח נתוני אשראי\n בוחרים מס טלפון, הודעה\n לוחצים על- שלח לי קוד ומזינים את הקוד שקיבלנו\n לוחצים על- שמירה והדפסה\n  PDF מייצאים כקובץ ",
        computer:"נכנסים לאתר\n לוחצים על- דוחות\n לוחצים על- דוח נתוני אשראי\nבוחרים מס טלפון,הודעה\nלוחצים על- שלח לי קוד ומזינים את הקוד שקיבלנו\n לוחצים על- שמירה והדפסה\n  PDF מייצאים כקובץ "
    }
},
bank6:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על שלושת הנקודות\nלוחצים על- התפריט מצד שמאל\nלוחצים על- עובר ושב\nלוחצים על- תנועות בחשבון\nלוחצים על- החיפוש המתקדם משמאל למעלה\n בוחרים תקופה\nלוחצים על- צילום\n בצד שמאל למעלה לוחצים \n  PDF על ייצוא",
        computer:"נכנסים לתאר\nלוחצים על- התפריט מצד שמאל\nלוחצים על- עובר ושב\nלוחצים על- תנועות בחשבון\nלוחצים על- החיפוש המתקדם משמאל למעלה\n בוחרים תקופה\nלוחצים על- צילום\n בצד שמאל למעלה לוחצים \n  PDF על ייצוא"
    },

    accountSub:{
        phone:"נכנסים לאפליקציה\n נלחץ על- עבורך\nנלחץ על- אישור ניהול חשבון\nבצד שמאלה נלחץ על החץ\n הקובץ ירד על הטלפון",
        computer:"נכנס לאתר\n בצד ימין בתפריט נלחץ על- דוחות ואישורים\n נלחץ על- אישור ניהול חשבון\n נבחר בעברית\nהקובץ ירד לנו אוטומית למחשב"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על שלושת הנקודות\n בצד ימין בתפריט לחוצים על- דוחות ואישורים\nלוחצים על- ריכוז יתרות\nבוחרים בעברית\nלוחצים על שמירה מצד שמאל למעלה",
        computer:"נכנסים לאתר\n בצד ימין בתפריט לחוצים על- דוחות ואישורים\nלוחצים על- ריכוז יתרות\nבוחרים בעברית\nלוחצים על שמירה מצד שמאל למעלה"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\n לוחצים על שלושת הנקודות\n נלחץ על- לגרסה למחשב\nבצד ימין בתפריט לוחצים על- כרטיסי אשראי\nלוחצים על- כרטיסים בחשבון שלי\nלוחצים על הכרטיס הרצוי,בוחרים בחודש הרצוי \n בצד שמאל למעלה- שמור כ PDF",
        computer:"נכנסים לאתר\nבצד ימין בתפריט לוחצים על- כרטיסי אשראי\nלוחצים על- כרטיסים בחשבון שלי\nלוחצים על הכרטיס הרצוי,בוחרים בחודש הרצוי \n בצד שמאל למעלה- שמור כ PDF"
    }
},
bank7:{
    moneyFlowSub:{
        phone:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי",
        computer:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי"
    },

    accountSub:{
        phone:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי",
        computer:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי"
    },

    moneyLeftSub:{
        phone:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי",
        computer:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי"
    },

    creditSub:{
        phone:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי",
        computer:"מתקשרים לבנק הדואר\nטלפון: 02-5005300\nמזינים תעודת זהות\nמקישים על מנת לדבר עם נציג\nמבקשים לשלוח למייל את המסמך הרצוי"
    }
},
bank8:{
    moneyFlowSub:{
        phone:"נכנסים לאפליקציה \n בלשונית למעלה לוחצים על- עובר ושב\n לוחצים על- סינון\n לוחצים על-חצי שנה אחורה\n מפיקים מתוך העמודים שהתקבלו את שלושת החודשים האחרונים",
        computer:"נכנסים לאתר\nלוחצים על הלשונית- עובר ושב\nבתפריט לוחצים על- תנועות בחשבון\nבוחרים את שלושת החודשים האחרונים\nלוחצים על אייקון המדפסת\nלוחצים על החץ שמצביע מטה על המילה יעד\n  PDF לוחצים על- שמירה כקובץ"
    },

    accountSub:{
        phone:" נכנסים לאפליקציה\n בלשונית למעלה, לוחצים על- ריכוז יתרות\n לוחצים על- אישורים ודחות להורדה\n לוחצים על- אישור ניהול חשבון\n לוחצים על- אישור בעברית",
        computer:"נכנסים לאתר\n לוחצים על- להפיק אישורים\n בוחרים-אישור ניהול חשבון\n PDFלוחצים על- הצג כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאפליקציה\n בלשונית למעלה, לוחצים על- ריכוז יתרות\n מצלמים את המסך שהתקבל",
        computer:"נכנסים לאתר\n לוחצים על הלשונית- עובר ושב\n לוחצים על- מידע\n לוחצים על- ריכוז יתרה\n לוחצים על- יום עסקים אחרון\n לוחצים על אייקון המדפסת,על החץ שמצביע למטה על יד המילה יעד\n   PDF לוחצים על- שמירה כקובץ"
    },

    creditSub:{
        phone:"נכנסים לאפליקציה\n בלשונית למעלה, לוחצים על- כרטיסי אשראי\n בוחרים את הכרטיס הרצוי\n לוחצים על- בחר חודש\n בוחרים את החודשים הרלוונטיים",
        computer:"נכנסים לאתר\n לוחצים על הלשונית- כרטיסי אשראי\n לוחצים על-מידע\n לוחצים על- חיוסים קודמים\n לוחצים על- תקופה\n לוחצים על- תאריך מדוייק\n בוחרים את שלושת החודשים האחרונים\n לוחצים על אייקון המדפסת,החץ שמצביע כלפי מטה על יד המילה יעד\n PDF לוחצים על- שמירה כקובץ"
    }
},
bank9:{
    moneyFlowSub:{
        phone:"נכנסים לאפליקציה\n לוחצים על- פרופיל\n  לוחצים על- מסמכים\n לוחצים על- החשבון שלי\n לוחצים על- פירוט הפעולות לחשבון לחודשים הרלוונטיים",
        computer:"נכנסים לאתר\n לוחצים על- פרופיל\n  לוחצים על- מסמכים\n לוחצים על- החשבון שלי\n לוחצים על- פירוט הפעולות לחשבון לחודשים הרלוונטיים"
    },

    accountSub:{
        phone:"נכנסים לאפליקציה\nלוחצים על- פרופיל\nלוחצים על-מסמכים\nלוחצים על הכפתור הורוד, הפקת סמך חדש\nלוחצים על- אישור בעלות חשבון\nלוחצים על- אישור\nמורידים את המסמך דרך הקטגוריה- החשבון שלי",
        computer:"נכנסים לאתר\nלוחצים על- פרופיל\nלוחצים על-מסמכים\nלוחצים על הכפתור הורוד, הפקת סמך חדש\nלוחצים על- אישור בעלות חשבון\nלוחצים על- אישור\nמורידים את המסמך דרך הקטגוריה- החשבון שלי"
    },

    moneyLeftSub:{
        phone:"נכנסים לאפליקציה\nלוחצים על-פרופיל\nלוחצים על- מסמכים\nלוחצים על הכפתור הורוד, הפקת מסמך חדש\nלוחצים על- ריכוז יתרות\nבוחרים את התאריך הרלוונטי, לוחצים על אישור\nמורידים את המסמך דרך הקטגוריה-החשבון",
        computer:"נכנסים לאתר\nלוחצים על-פרופיל\nלוחצים על- מסמכים\nלוחצים על הכפתור הורוד, הפקת מסמך חדש\nלוחצים על- ריכוז יתרות\nבוחרים את התאריך הרלוונטי, לוחצים על אישור\nמורידים את המסמך דרך הקטגוריה-החשבון"
    },

    creditSub:{
        phone:"נכנסים לאפליקציה\nמחפשים- פירוט חיובים\nלוחצים על- דפי פירוט והמכתבים\nלוחצים על- דפי פירוט\nבוחרים כרטיס וחודש\nמורידים את המסמך",
        computer:"נכנסים לאתר\nמחפשים- פירוט חיובים\nלוחצים על- דפי פירוט והמכתבים\nלוחצים על- דפי פירוט\nבוחרים כרטיס וחודש\nמורידים את המסמך"
    }
},
bank10:{
    moneyFlowSub:{
        phone:"נכנסים לאפליקציה\nלוחצים על שלושת הפסים בראש העמוד\nלוחצים על- חשבון עוש\nמגדירים תאריכים\nPDFלוחצים על- ייצוא כ ",
        computer:"נכנסים לאתר\n בסרגל הכלים לוחצים על- ניהול חשבון עוש\n מעל הטבלה, מצד שמאל מגדירים תאריכים\nלוחצים על- ייצוא קובץ\n PDFמייצאים כ"
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\nבסרגל הכלים לוחצים על- מידע והגדרות\nלוחצים על- ניהול חשבון\nלוחצים על- ייצוא כקובץ\nPDFמייצאים כ",
        computer:"נכנסים לאתר\nבסרגל הכלים לוחצים על- מידע והגדרות\nלוחצים על- ניהול חשבון\nלוחצים על- ייצוא כקובץ\nPDFמייצאים כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\n בסרגל הכלים לוחצים על- חשבונות עוש\nמצד ימין לוחצים על- ריכוז יתרות\nלוחצים על- ייצא כקובץ\n PDFמייצאים כ",
        computer:"נכנסים לאתר\n בסרגל הכלים לוחצים על- חשבונות עוש\nמצד ימין לוחצים על- ריכוז יתרות\nלוחצים על- ייצא כקובץ\n PDFמייצאים כ"
    },

    creditSub:{
        phone:"נכנסים לאפליקציה\nלוחצים על- כרטיסי אשראי\nבוחרים את הכרטיס הרצוי\nלוחצים על- פירוט חיובים\nבוחרים את התקופה הרצויה\n  PDF מייצאים כקובץ",
        computer:"נכנסים לאתר\n לוחצים בתפריט הראשי על- כרטיסי אשראי\n בוחרים את הכרטיס הרצוי\nלוחצים על פירוט חיובים\nבוחרים את התקופה הרצויה\n  PDF מייצאים כקובץ"
    }
},
bank12:{
    moneyFlowSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\n לוחצים על- עובר ושב\n בוחרים תאריכים\n PDFלוחצים על האופציה- ייצוא כ",
        computer:"נכנסים לאתר\n לוחצים על- עובר ושב\n בוחרים תאריכים\n PDFלוחצים על האופציה- ייצוא כ"
    },

    accountSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\n לוחצים על- תפריט\nלוחצים על- עובר ושב\nלוחצים על- אישור בעלות חשבון\nלוחצים על- ייצוא כקובץ\n PDFמייצאים כ",
        computer:" נכנסים לאתר\n לוחצים על- תפריט\nלוחצים על- עובר ושב\nלוחצים על- אישור בעלות חשבון\nלוחצים על- ייצוא כקובץ\n PDFמייצאים כ"
    },

    moneyLeftSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\nלוחצים על- תפריט\nלוחצים על- עובר ושב\nלוחצים על-ריכוז יתרות\n לוחצים על ייצוא כקובץ\n  PDFמייצאים כ",
        computer:"נכנסים לאתר\nלוחצים על- תפריט\nלוחצים על- עובר ושב\nלוחצים על-ריכוז יתרות\n לוחצים על ייצוא כקובץ\n  PDFמייצאים כ"
    },

    creditSub:{
        phone:"נכנסים לאתר דרך האינטרנט\nלוחצים על שלושת הנקודות\nלוחצים על- גרסה למחשב\nלוחצים על- תפריט\nלוחצים על-כרטיס אשראי\nלוחצים על- פירוט חיובים\nבוחרים את התקופה הרצויה\n PDF לוחצים על- הורדת קובת כ",
        computer:"נכנסים לאתר\nלוחצים על- תפריט\nלוחצים על-כרטיס אשראי\nלוחצים על- פירוט חיובים\nבוחרים את התקופה הרצויה\n PDF לוחצים על- הורדת קובת כ"
    }
},
};

window.addEventListener("pageshow", ()=>{

    const textBox = document.getElementById("textContent");

    if(!textBox) return;

    activeBank = sessionStorage.getItem("selectedBank");
    activeSubject = sessionStorage.getItem("selectedSubject");

    const title = document.getElementById("titleImg");

    if(title){
        title.src = `assets/titles/${activeSubject}.png`;
    }

    updateBankText();

});

function updateBankText(){

    const textBox = document.getElementById("textContent");

    textBox.innerText =
    banksData[activeBank][activeSubject][activeDevice];

}

const phoneButton = document.getElementById("phoneBtn");
const computerButton = document.getElementById("computerBtn");

if(phoneButton && computerButton){
phoneButton.addEventListener("click", ()=>{

    activeDevice = "phone";

    phoneButton.src = "assets/elements/phoneClicked.png";
    computerButton.src = "assets/elements/computer.png";

    updateBankText();

});

computerButton.addEventListener("click", ()=>{

    activeDevice = "computer";

    computerButton.src = "assets/elements/computerClicked.png";
    phoneButton.src = "assets/elements/phone.png";

    updateBankText();

});

}